In [11]:
import pandas as pd
import numpy as np

In [2]:
data_url = 'https://gist.githubusercontent.com/sh7ata/56976975b3c67caabb2efd80bb3a8467/raw/f1b7d2abf6770548edafee58ea15be71e2d28aac/Nutrition.csv'

In [3]:
nutrition = pd.read_csv(data_url, index_col=[1])
nutrition.head(n=1)

,Unnamed: 0,serving_size,calories,total_fat,saturated_fat,cholesterol,sodium,choline,folate,folic_acid,...,fat,saturated_fatty_acids,monounsaturated_fatty_acids,polyunsaturated_fatty_acids,fatty_acids_total_trans,alcohol,ash,caffeine,theobromine,water
name,,,,,,,,,,,,,,,,,,,,,
Cornstarch,0,100 g,381,0.1g,NaN,0,9.00 mg,0.4 mg,0.00 mcg,0.00 mcg,...,0.05 g,0.009 g,0.016 g,0.025 g,0.00 mg,0.0 g,0.09 g,0.00 mg,0.00 mg,8.32 g

In [9]:
nutrition = nutrition.drop('Unnamed: 0', axis=1)
nutrition.head(n=2)

,serving_size,calories,total_fat,saturated_fat,cholesterol,sodium,choline,folate,folic_acid,niacin,...,fat,saturated_fatty_acids,monounsaturated_fatty_acids,polyunsaturated_fatty_acids,fatty_acids_total_trans,alcohol,ash,caffeine,theobromine,water
name,,,,,,,,,,,,,,,,,,,,,
Cornstarch,100 g,381,0.1g,NaN,0,9.00 mg,0.4 mg,0.00 mcg,0.00 mcg,0.000 mg,...,0.05 g,0.009 g,0.016 g,0.025 g,0.00 mg,0.0 g,0.09 g,0.00 mg,0.00 mg,8.32 g
"Nuts, pecans",100 g,691,72g,6.2g,0,0.00 mg,40.5 mg,22.00 mcg,0.00 mcg,1.167 mg,...,71.97 g,6.180 g,40.801 g,21.614 g,0.00 mg,0.0 g,1.49 g,0.00 mg,0.00 mg,3.52 g

In [17]:
df = pd.DataFrame({
    'age':[12,13,14,16],
    'wieght':[41.1,34.5,83.2,90.1],
    'height':['1.72','1.74','1.91','1.54']
    })
df.astype(float)

    age  wieght  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0    83.2    1.91
3  16.0    90.1    1.54

In [18]:
df.loc[2,'wieght'] = np.nan

In [19]:
df.loc[1,:] = np.nan

In [20]:
df

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [21]:
df.dropna()

    age  wieght height
0  12.0    41.1   1.72
3  16.0    90.1   1.54

In [22]:
df

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [23]:
df.dropna(how='any',axis=0)

    age  wieght height
0  12.0    41.1   1.72
3  16.0    90.1   1.54

In [26]:
df.dropna(how='all', axis=0)

    age  wieght height
0  12.0    41.1   1.72
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [27]:
df.dropna(how='all', axis=1)

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [33]:
df.dropna(thresh=3, axis=0)

    age  wieght height
0  12.0    41.1   1.72
3  16.0    90.1   1.54

In [34]:
df.dropna(how='any', axis=0)

    age  wieght height
0  12.0    41.1   1.72
3  16.0    90.1   1.54

In [35]:
df.dropna(thresh=3, axis=1)

    age height
0  12.0   1.72
1   NaN    NaN
2  14.0   1.91
3  16.0   1.54

In [36]:
df.dropna(thresh=df.shape[1], axis=0)

    age  wieght height
0  12.0    41.1   1.72
3  16.0    90.1   1.54

In [37]:
df.dropna(thresh=df.shape[1], axis=1)

    age height
0  12.0   1.72
1   NaN    NaN
2  14.0   1.91
3  16.0   1.54

In [38]:
df.shape

(4, 3)

In [42]:
df.dropna(thresh=df.shape[0],axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [41]:
df.dropna(how='any', axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [43]:
df.dropna(how='all',axis=1)

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [44]:
df.dropna(thresh=3, axis=1)

    age height
0  12.0   1.72
1   NaN    NaN
2  14.0   1.91
3  16.0   1.54

In [45]:
df.dropna(thresh=2, axis=1)

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [46]:
df

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [49]:
df.dropna(how='all', axis=1, inplace=True)

In [50]:
df

    age  wieght height
0  12.0    41.1   1.72
1   NaN     NaN    NaN
2  14.0     NaN   1.91
3  16.0    90.1   1.54

In [51]:
df.dropna(how='any', axis=1, inplace=True)

In [52]:
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]